/*
Project name: "Массивы в Java"
21.10.2016
*/
public class Arrays {
  public static void main(String[] args) {
    int number = 10; //Примитивный тип данныхю. Его можно сравнить с коробкой, в которой лежит только один предмет
    int[] numbers = new int[5]; //Переменную "numbers" ссылаем на новый объект класса "Массив". Ссылочный тип данных.
                                //Его можно сравнить с коробкой, в которой лежит несколько предметов (в данном случае - 5)
                                //Если не инициализировать каждый элемент массива, то по-умолчанию их значения равны нулю
    /*
    numbers[0] = 10;  //Построчная инициализация массива с индексом "0"
    numbers[1] = 20;  //Построчная инициализация массива с индексом "0". Неудобный спасоб, особенно если нужно инициализировать много элементов
    */
    for(int i = 0; i < numbers.length; i++) {  //Цикл продолжается, пока не инициализируются все элементы массива
      numbers[i] = i * 10;
      System.out.println(numbers[i]);
    }
    System.out.println();
    int [] numbers1 = {1,2,3};  //Этим способом мы сразу создаем массив и инициализируем значения элементов
    for(int i = 0; i < numbers1.length; i++){
      System.out.println(numbers1[i]);
    }
  }
}
