/*
Project name: "Многомерные массивы"
23.10.2016
*/
public class Multidimensional_arrays {
  public static void main(String[] args) {
    int[] number = {1,2,3}; //Одномерный массив

    int [][] matrice = {{1,2,3,4,5},   //Двухмерный массив с тремя элементами:
                        {4},           //первый элемент - {1,2,3}, второй элемент {4,5,6}, третий элемент {7,8,9}
                        {7,8,9}};
    System.out.println(matrice[2][2]);  //Выводим конкретное число из элемента массива (в данном случае мы ссылаемся на на третью строку, третий столбец "matrice[2][2]")
    System.out.println(matrice[1][0]);  //Выодим на экран число 4
    System.out.println(matrice[0][4]);  //Выодим на экран число 5

    String[][] strings = new String[2][3];  //Создаем двухмерный массив размера: 2 строки, 3 столбца
    strings[0][1] = "Привет"; //Инициализируем элемент в первой строке, втором столбце
    System.out.println(strings[0][1]);
  }
}
