/*
Project name: "Многомерные массивы"
23.10.2016
*/
public class Multidimensional_arrays {
  public static void main(String[] args) {
    int[] number = {1,2,3}; //Одномерный массив

    int [][] matrice = {{1,2,3},   //Двухмерный массив с тремя элементами:
                        {4,5,6},   //первый элемент - {1,2,3}, второй элемент {4,5,6}, третий элемент {7,8,9}
                        {7,8,9}};
    System.out.println(matrice[2][2]);  //Выводим конкретное число из элемента массива (в данном случае мы ссылаемся на на третью строку, третий столбец "matrice[2][2]")
    System.out.println(matrice[1][0]);  //Выодим на экран число 4
  }
}
